#Пример 1
Capitals={}
Capitals=dict()
def contry():
    Capitals["Нидерланды"]="Амстердам"
    Capitals["Андорра"]="Андорра-ла-Велья"
    Capitals["Греция"]="Афины"
    Capitals["Сербия"]="Белград"
    Capitals["Германия"]="Берлин"
    Capitals["Швейцария"]="Берн"
    Capitals["Словакия"]="Братислава"
    Capitals["Бельгия"]="Брюссель"
    Capitals["Венгрия"]="Будапешт"
    Capitals["Румыния"]="Бухарест"
    Capitals["Лихтенштейн"]="Вадуц"
    Capitals["Мальта"]="Валлетта"
    Capitals["Польша"]="Варшава"
    Capitals["Ватикан"]="Ватикан"
    Capitals["Австрия"]="Вена"
    Capitals["Литва"]="Вильнюс"
    Capitals["Ирландия"]="Дублин"
    Capitals["Хорватия"]="Загреб"
    Capitals["Украина"]="Киев"
    Capitals["Молдавия"]="Кишинёв"
    Capitals["Дания"]="Копенгаген"
    Capitals["Португалия"]="Лиссабон"
    Capitals["Великобритания"]="Лондон"
    Capitals["Словения"]="Любляна"
    Capitals["Люксембург"]="Люксембург"
    Capitals["Испания"]="Мадрид"
    Capitals["Белоруссия"]="Минск"
    Capitals["Монако"]="Монако"
    Capitals["Россия"]="Москва"
    Capitals["Норвегия"]="Осло"
    Capitals["Франция"]="Париж"
    Capitals["Черногория"]="Подгорица"
    Capitals["Чехия"]="Прага"
    Capitals["Исландия"]="Рейкьявик"
    Capitals["Латвия"]="Рига"
    Capitals["Италия"]="Рим"
    Capitals["Сан-Марино"]="Сан-Марино"
    Capitals["Босния и Герцеговина"]="Сараево"
    Capitals["Северная Македония"]="Скопье"
    Capitals["Болгария"]="София"
    Capitals["Швеция"]="Стокгольм"
    Capitals["Эстония"]="Таллин"
    Capitals["Албания"]="Тирана"
    Capitals["Финляндия"]="Хельсинки"
Capitals["Euroopa riigid"]="Нидерланды, Андорра, Греция, Сербия, Германия, Швейцария, Словакия, Бельгия, Венгрия, Румыния, Лихтенштейн, Мальта, Польша, Ватикан, Австрия, Литва, Ирландия, Хорватия, Украинa, Молдавия, Дания, Португалия, Великобритания, Словения, Люксембург, Испания, Белоруссия, Монако, Россия, Норвегия, Франция, Черногория, Чехия, Исландия, Латвия, Италия, Сан-Марино, Босния и Герцеговина, Северная Македония, Болгария, Швеция, Эстония, Албания, Финляндия"
Countries=["Нидерланды", "Андорра", "Греция", "Сербия", "Германия", "Швейцария", "Словакия", "Бельгия", "Венгрия", "Румыния", "Лихтенштейн", "Мальта", "Польша", "Ватикан", "Австрия", "Литва", "Ирландия", "Хорватия", "Украинa", "Молдавия", "Дания", "Португалия", "Великобритания", "Словения", "Люксембург", "Испания", "Белоруссия", "Монако", "Россия", "Норвегия", "Франция", "Черногория", "Чехия", "Исландия", "Латвия", "Италия", "Сан-Марино", "Босния и Герцеговина", "Северная Македония", "Болгария", "Швеция", "Эстония", "Албания", "Финляндия"]
Country=["Амстердам, Андорра-ла-Велья, Афины, Белград, Берлин, Берн, Братислава, Брюссель, Будапешт, Бухарест, Вадуц, Валлетта, Варшава, Ватикан, Вена, Вильнюс, Дублин, Загреб, Киев, Кишинёв, Копенгаген, Лиссабон, Лондон, Любляна, Люксембург, Мадрид, Минск, Монако, Москва, Осло, Париж, Подгорица, Прага, Рейкьявик, Рига, Рим, Сан-Марино, Сараево, Скопье, София, Стокгольм, Таллин, Тирана, Хельсинки"]
contry()
for country in Countries:
 if country in Capitals:
    print("Столица страны " + country + ": " + Capitals[country])

 else:
    print("В базе нет страны c названием " + country)